Revit 2027 API
ParameterTypeId.EnergyAnalysisConstructionJson Property
 "JSON data for Analytical Constructions"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisConstructionJson { get; }
Public Shared ReadOnly Property EnergyAnalysisConstructionJson As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisConstructionJson {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisConstructionJson : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace